MikroElektronika/core_packages/ARM/gcc_clang/def/ti/MSPM0L1228-Q1/mcu.h
/******************************************************************************
* Ignore unused variables                                                     *
******************************************************************************/

#if   defined (__CC_ARM)
  #pragma push
  #pragma anon_unions
#elif defined (__ICCARM__)
  #pragma language=extended
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
  #pragma clang diagnostic push
  #pragma clang diagnostic ignored "-Wc11-extensions"
  #pragma clang diagnostic ignored "-Wreserved-id-macro"
#elif defined (__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined (__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined (__TASKING__)
  #pragma warning 586
#elif defined (__CSMC__)
  /* anonymous unions are enabled by default */
#else
  #warning Not supported compiler type
#endif


/******************************************************************************
* Processor and Core Peripheral Section                                       *
******************************************************************************/

#define __CM0PLUS_REV           0x0001U    /* Core revision r0p1 */
#define __MPU_PRESENT           0x0001U    /* MPU present */
#define __VTOR_PRESENT          0x0001U    /* VTOR present */
#define __NVIC_PRIO_BITS        0x0002U    /* Number of bits used for Priority Levels */
#define __Vendor_SysTickConfig  0x0000U    /* Set to 1 if different SysTick Config is used */

#include "core_cm0plus.h"                  /* Processor and core peripherals */
// Note: Added for MikroE implementation.
#define __MSPM0L1228__

/******************************************************************************
* Peripheral headers                                                          *
******************************************************************************/
/** @addtogroup MSPM0L122X_Peripherals MSPM0L122X Peripherals
  MSPM0L122X Peripheral registers structures
  @{
*/

#include <ti/devices/msp/peripherals/hw_adc12.h>
#include <ti/devices/msp/peripherals/hw_aesadv.h>
#include <ti/devices/msp/peripherals/hw_comp.h>
#include <ti/devices/msp/peripherals/hw_crcp.h>
#include <ti/devices/msp/peripherals/hw_dma.h>
#include <ti/devices/msp/peripherals/hw_flashctl.h>
#include <ti/devices/msp/peripherals/hw_gpio.h>
#include <ti/devices/msp/peripherals/hw_gptimer.h>
#include <ti/devices/msp/peripherals/hw_i2c.h>
#include <ti/devices/msp/peripherals/hw_lfss.h>
#include <ti/devices/msp/peripherals/hw_iomux.h>
#include <ti/devices/msp/peripherals/hw_keystorectl.h>
#include <ti/devices/msp/peripherals/hw_rtc.h>
#include <ti/devices/msp/peripherals/hw_spi.h>
#include <ti/devices/msp/peripherals/hw_trng.h>
#include <ti/devices/msp/peripherals/hw_uart.h>
#include <ti/devices/msp/peripherals/hw_vref.h>
#include <ti/devices/msp/peripherals/hw_wuc.h>
#include <ti/devices/msp/peripherals/hw_wwdt.h>
#include <ti/devices/msp/peripherals/m0p/hw_factoryregion.h>
#include <ti/devices/msp/peripherals/m0p/hw_cpuss.h>
#include <ti/devices/msp/peripherals/m0p/hw_debugss.h>
#include <ti/devices/msp/peripherals/m0p/hw_sysctl.h>

#define __MSPM0_HAS_ADC12__
#define __MSPM0_HAS_COMP__
#define __MSPM0_HAS_GPIO__
#define __MSPM0_HAS_TIMER_A__
#define __MSPM0_HAS_TIMER_G__
#define __MSPM0_HAS_I2C__
#define __MSPM0_HAS_SPI__
#define __MSPM0_HAS_TRNG__
#define __MSPM0_HAS_RTC_A__
#define __MSPM0_HAS_UART_EXTD__
#define __MSPM0_HAS_UART_MAIN__
#define __MSPM0_HAS_VREF__
#define __MSPM0_HAS_WWDT__
#define __MSPM0_HAS_AESADV__
#define __MSPM0_HAS_CRCP__
#define __MSPM0_HAS_KEYSTORE_CTL__
#define __MSPM0_HAS_LFSS__
#define __MSPM0_HAS_SCRATCHPAD__
#define __MSPM0_HAS_TIO__
#define  __MSPM0_HAS_IWDT__
#define __MSPM0_HAS_ECC__


/*@}*/ /* end of group MSPM0L122X_Peripherals */

/******************************************************************************
* Device and peripheral memory map                                            *
******************************************************************************/
/** @addtogroup MSPM0L122X_MemoryMap MSPM0L122X Memory Mapping
  @{
*/

#define DEBUGSS_BASE                   (0x400C7000U)     /*!< Base address of module DEBUGSS */
#define COMP0_BASE                     (0x40008000U)     /*!< Base address of module COMP0 */
#define WWDT0_BASE                     (0x40080000U)     /*!< Base address of module WWDT0 */
#define I2C1_BASE                      (0x400F2000U)     /*!< Base address of module I2C1 */
#define UART0_BASE                     (0x40108000U)     /*!< Base address of module UART0 */
#define GPIOA_BASE                     (0x400A0000U)     /*!< Base address of module GPIOA */
#define I2C0_BASE                      (0x400F0000U)     /*!< Base address of module I2C0 */
#define UART2_BASE                     (0x40100000U)     /*!< Base address of module UART2 */
#define ADC0_BASE                      (0x40004000U)     /*!< Base address of module ADC0 */
#define ADC0_PERIPHERALREGIONSVT_BASE  (0x4055A000U)     /*!< Base address of module ADC0_PERIPHERALREGIONSVT */
#define SPI0_BASE                      (0x40468000U)     /*!< Base address of module SPI0 */
#define VREF_BASE                      (0x40030000U)     /*!< Base address of module VREF */
#define SPI1_BASE                      (0x4046A000U)     /*!< Base address of module SPI1 */
#define KEYSTORECTL_BASE               (0x400AC000U)     /*!< Base address of module KEYSTORECTL */
#define TRNG_BASE                      (0x40444000U)     /*!< Base address of module TRNG */
#define UART3_BASE                     (0x40102000U)     /*!< Base address of module UART3 */
#define UART1_BASE                     (0x4010A000U)     /*!< Base address of module UART1 */
#define UART4_BASE                     (0x40104000U)     /*!< Base address of module UART4 */
#define I2C2_BASE                      (0x400F4000U)     /*!< Base address of module I2C2 */
#define GPIOB_BASE                     (0x400A2000U)     /*!< Base address of module GPIOB */
#define GPIOC_BASE                     (0x400A4000U)     /*!< Base address of module GPIOC */
#define FLASHCTL_BASE                  (0x400CD000U)     /*!< Base address of module FLASHCTL */
#define AESADV_BASE                    (0x40442000U)     /*!< Base address of module AESADV */
#define CRCP0_BASE                     (0x40440000U)     /*!< Base address of module CRCP0 */
#define TIMG0_BASE                     (0x40084000U)     /*!< Base address of module TIMG0 */
#define TIMG4_BASE                     (0x4008C000U)     /*!< Base address of module TIMG4 */
#define TIMG8_BASE                     (0x40090000U)     /*!< Base address of module TIMG8 */
#define TIMG12_BASE                    (0x40870000U)     /*!< Base address of module TIMG12 */
#define TIMA0_BASE                     (0x40860000U)     /*!< Base address of module TIMA0 */
#define DMA_BASE                       (0x4042A000U)     /*!< Base address of module DMA */
#define LFSS_BASE                      (0x40094000U)     /*!< Base address of module LFSS */
#define RTC_A_BASE                     (0x40094000U)     /*!< Base address of module RTC_A */
#define SYSCTL_BASE                    (0x400AF000U)     /*!< Base address of module SYSCTL */
#define TIMG5_BASE                     (0x4008E000U)     /*!< Base address of module TIMG5 */
#define IOMUX_BASE                     (0x40428000U)     /*!< Base address of module IOMUX */
#define CPUSS_BASE                     (0x40400000U)     /*!< Base address of module CPUSS */
#define WUC_BASE                       (0x40424000U)     /*!< Base address of module WUC */
#define FACTORYREGION_BASE             (0x41C40000U)     /*!< Base address of module FACTORYREGION */


/*@}*/ /* end of group MSPM0L122X_MemoryMap */

